tap "homebrew/bundle"
tap "kcl-lang/tap"
brew "ansible"
brew "coreutils"
brew "asdf"
brew "chezmoi"
brew "colima"
brew "docker-compose"
brew "gcc"
brew "gh"
brew "git"
brew "go"
brew "go-jsonnet"
brew "go@1.17"
brew "grsync"
brew "gum"
brew "helm"
brew "htop"
brew "httpie"
brew "ipython"
brew "jq"
brew "jsonnet-bundler"
brew "k3d"
brew "kind"
brew "kubernetes-cli"
brew "pipx"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rclone"
brew "tanka"
brew "terraform"
brew "yq"
brew "kcl-lang/tap/kcl"
cask "secretive"
cask "visual-studio-code"
cask "wireshark"
vscode "1password.op-vscode"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "blinkshellinc.blink-fs"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "davidwang.ini-for-vscode"
vscode "donjayamanne.githistory"
vscode "elagil.pre-commit-helper"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "fredwangwang.vscode-hcl-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "inercia.vscode-k3d"
vscode "irongeek.vscode-env"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jinliming2.vscode-go-template"
vscode "kcl.kcl-vscode-extension"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-github-issue-notebooks"
vscode "oderwat.indent-rainbow"
vscode "paulober.pico-w-go"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.partial-diff"
vscode "samuelcolvin.jinjahtml"
vscode "shardulm94.trailing-spaces"
vscode "tanhakabir.rest-book"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vmware.vscode-concourse"
vscode "vscodevim.vim"
vscode "weaveworks.vscode-gitops-tools"
vscode "yzhang.markdown-all-in-one"
