brew "act"
brew "actionlint"
brew "age"
brew "ansible"
brew "ansible-lint"
brew "asdf"
brew "chezmoi"
brew "colima"
brew "coreutils"
brew "cue"
brew "dateutils"
brew "daveshanley/vacuum/vacuum"
brew "derailed/k9s/k9s"
brew "docker"
brew "docker-compose"
brew "dos2unix"
brew "fatsort"
brew "fd"
brew "fdupes"
brew "fluxcd/tap/flux"
brew "fx"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "glow"
brew "go"
brew "go-jsonnet"
brew "go@1.17"
brew "golangci-lint"
brew "goreleaser", link: false
brew "gping"
brew "grsync"
brew "gum"
brew "hadolint"
brew "harfbuzz"
brew "hcl2json"
brew "helm"
brew "homeport/tap/dyff"
brew "htop"
brew "httpie"
brew "int128/kubelogin/kubelogin"
brew "ipython"
brew "jc"
brew "jfrog-cli"
brew "jq"
brew "jsonnet-bundler"
brew "k3d"
brew "k6"
brew "kcl-lang/tap/kcl"
brew "kind"
brew "krew"
brew "kubeconform"
brew "kubernetes-cli"
brew "minicom"
brew "mise"
brew "moreutils"
brew "ncdu"
brew "neovim"
brew "nushell"
brew "pinact"
brew "pipx"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "quicktype"
brew "rclone"
brew "ripgrep"
brew "shellcheck"
brew "ssh-copy-id"
brew "starship"
brew "tanka"
brew "terraform"
brew "terraform-docs"
brew "terragrunt"
brew "tflint"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "vacuum", link: false
brew "vhs"
brew "vim"
brew "wakeonlan"
brew "wget"
brew "yq"
cask "claude-code"
cask "codex"
cask "daveshanley/vacuum/vacuum"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "goreleaser/tap/goreleaser"
cask "nikitabobko/tap/aerospace"
cask "secretive"
cask "visual-studio-code"
cask "wireshark-app"
go "cmd/go"
go "cmd/gofmt"
krew "ctx"
krew "ns"
tap "daveshanley/vacuum"
tap "derailed/k9s"
tap "fluxcd/tap"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homeport/tap"
tap "int128/kubelogin"
tap "kcl-lang/tap"
tap "nikitabobko/tap"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "adamhartford.vscode-base64"
vscode "alefragnani.project-manager"
vscode "bierner.markdown-mermaid"
vscode "blinkshellinc.blink-fs"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "chdsbd.github-code-owners"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "davidwang.ini-for-vscode"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "elagil.pre-commit-helper"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "foxundermoon.shell-format"
vscode "fredwangwang.vscode-hcl-format"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "grafana.grafana-alloy"
vscode "grafana.grafana-vscode"
vscode "grafana.vscode-jsonnet"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hilleer.yaml-plus-json"
vscode "inercia.vscode-k3d"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jinliming2.vscode-go-template"
vscode "kcl.kcl-vscode-extension"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-github-issue-notebooks"
vscode "oderwat.indent-rainbow"
vscode "paulober.pico-w-go"
vscode "premparihar.gotestexplorer"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.partial-diff"
vscode "samuelcolvin.jinjahtml"
vscode "shardulm94.trailing-spaces"
vscode "takumii.markdowntable"
vscode "tanhakabir.rest-book"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "ventura.prom"
vscode "vmware.vscode-concourse"
vscode "vscodevim.vim"
vscode "weaveworks.vscode-gitops-tools"
vscode "yzhang.markdown-all-in-one"
